<html>
  <head>
    <meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">.lst-kix_tfb401rabk56-7>li:before{content:"\0025cb   "}.lst-kix_tfb401rabk56-6>li:before{content:"\0025cf   "}.lst-kix_tfb401rabk56-8>li:before{content:"\0025a0   "}ul.lst-kix_vsdo7um3p5dy-5{list-style-type:none}.lst-kix_v5tni44gig6i-0>li:before{content:"\0025cf   "}.lst-kix_d781o4xwclh2-6>li:before{content:"\0025cf   "}ul.lst-kix_vsdo7um3p5dy-6{list-style-type:none}ul.lst-kix_vsdo7um3p5dy-3{list-style-type:none}.lst-kix_v5tni44gig6i-1>li:before{content:"\0025cb   "}ul.lst-kix_vsdo7um3p5dy-4{list-style-type:none}.lst-kix_v5tni44gig6i-2>li:before{content:"\0025a0   "}.lst-kix_d781o4xwclh2-8>li:before{content:"\0025a0   "}.lst-kix_d781o4xwclh2-4>li:before{content:"\0025cb   "}ul.lst-kix_vsdo7um3p5dy-7{list-style-type:none}.lst-kix_d781o4xwclh2-7>li:before{content:"\0025cb   "}ul.lst-kix_vsdo7um3p5dy-8{list-style-type:none}ul.lst-kix_vsdo7um3p5dy-1{list-style-type:none}ul.lst-kix_vsdo7um3p5dy-2{list-style-type:none}.lst-kix_d781o4xwclh2-5>li:before{content:"\0025a0   "}ul.lst-kix_vsdo7um3p5dy-0{list-style-type:none}.lst-kix_d781o4xwclh2-0>li:before{content:"\0025cf   "}.lst-kix_d781o4xwclh2-2>li:before{content:"\0025a0   "}.lst-kix_d781o4xwclh2-3>li:before{content:"\0025cf   "}ul.lst-kix_tfb401rabk56-1{list-style-type:none}ul.lst-kix_tfb401rabk56-2{list-style-type:none}.lst-kix_d781o4xwclh2-1>li:before{content:"\0025cb   "}ul.lst-kix_tfb401rabk56-0{list-style-type:none}ul.lst-kix_tfb401rabk56-5{list-style-type:none}ul.lst-kix_tfb401rabk56-6{list-style-type:none}ul.lst-kix_tfb401rabk56-3{list-style-type:none}ul.lst-kix_tfb401rabk56-4{list-style-type:none}ul.lst-kix_d781o4xwclh2-8{list-style-type:none}ul.lst-kix_tfb401rabk56-7{list-style-type:none}ul.lst-kix_d781o4xwclh2-6{list-style-type:none}ul.lst-kix_tfb401rabk56-8{list-style-type:none}ul.lst-kix_d781o4xwclh2-7{list-style-type:none}ul.lst-kix_d781o4xwclh2-4{list-style-type:none}ul.lst-kix_d781o4xwclh2-5{list-style-type:none}ul.lst-kix_d781o4xwclh2-2{list-style-type:none}ul.lst-kix_d781o4xwclh2-3{list-style-type:none}ul.lst-kix_d781o4xwclh2-0{list-style-type:none}ul.lst-kix_d781o4xwclh2-1{list-style-type:none}.lst-kix_v5tni44gig6i-7>li:before{content:"\0025cb   "}.lst-kix_v5tni44gig6i-6>li:before{content:"\0025cf   "}.lst-kix_v5tni44gig6i-4>li:before{content:"\0025cb   "}.lst-kix_v5tni44gig6i-3>li:before{content:"\0025cf   "}.lst-kix_v5tni44gig6i-5>li:before{content:"\0025a0   "}.lst-kix_tfb401rabk56-0>li:before{content:"\0025cf   "}.lst-kix_vsdo7um3p5dy-8>li:before{content:"\0025a0   "}.lst-kix_vsdo7um3p5dy-7>li:before{content:"\0025cb   "}.lst-kix_tfb401rabk56-2>li:before{content:"\0025a0   "}.lst-kix_tfb401rabk56-3>li:before{content:"\0025cf   "}.lst-kix_vsdo7um3p5dy-5>li:before{content:"\0025a0   "}.lst-kix_vsdo7um3p5dy-4>li:before{content:"\0025cb   "}.lst-kix_vsdo7um3p5dy-6>li:before{content:"\0025cf   "}.lst-kix_tfb401rabk56-5>li:before{content:"\0025a0   "}.lst-kix_tfb401rabk56-4>li:before{content:"\0025cb   "}.lst-kix_vsdo7um3p5dy-1>li:before{content:"\0025cb   "}.lst-kix_v5tni44gig6i-8>li:before{content:"\0025a0   "}ul.lst-kix_v5tni44gig6i-0{list-style-type:none}.lst-kix_vsdo7um3p5dy-0>li:before{content:"\0025cf   "}.lst-kix_vsdo7um3p5dy-2>li:before{content:"\0025a0   "}.lst-kix_vsdo7um3p5dy-3>li:before{content:"\0025cf   "}ul.lst-kix_v5tni44gig6i-7{list-style-type:none}ul.lst-kix_v5tni44gig6i-8{list-style-type:none}ul.lst-kix_v5tni44gig6i-5{list-style-type:none}ul.lst-kix_v5tni44gig6i-6{list-style-type:none}ul.lst-kix_v5tni44gig6i-3{list-style-type:none}.lst-kix_tfb401rabk56-1>li:before{content:"\0025cb   "}ul.lst-kix_v5tni44gig6i-4{list-style-type:none}ul.lst-kix_v5tni44gig6i-1{list-style-type:none}ul.lst-kix_v5tni44gig6i-2{list-style-type:none}ol{margin:0;padding:0}table td,table th{padding:0}.c0{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c7{color:#000000;font-weight:700;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:"Arial";font-style:normal}.c1{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:center}.c2{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c4{text-decoration-skip-ink:none;-webkit-text-decoration-skip:none;color:#1155cc;text-decoration:underline}.c9{background-color:#ffffff;max-width:451.4pt;padding:72pt 72pt 72pt 72pt}.c8{padding:0;margin:0}.c3{margin-left:36pt;padding-left:0pt}.c10{color:inherit;text-decoration:inherit}.c6{vertical-align:super}.c5{height:11pt}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style>
  </head>
  <body class="c9"><p class="c1"><span class="c7">&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1086;&#1077; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080; &#1089;&#1080;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1083;&#1083;&#1077;&#1082;&#1090;</span></p><p class="c2 c5"><span class="c0"></span></p><p class="c2"><span class="c0">&#1053;&#1072;&#1096;&#1072; &#1084;&#1080;&#1089;&#1089;&#1080;&#1103; - &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080;&#1085;&#1090;&#1077;&#1083;&#1083;&#1077;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1081; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1086;&#1082;&#1086;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1099;&#1093; &#1088;&#1077;&#1096;&#1072;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1085;&#1072; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1080; &#1089;&#1083;&#1086;&#1078;&#1085;&#1077;&#1077; &#1090;&#1077;&#1093;, &#1095;&#1090;&#1086; &#1088;&#1077;&#1096;&#1072;&#1102;&#1090; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1076;&#1083;&#1103; &#1091;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1080;&#1103; &#1078;&#1080;&#1079;&#1085;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082;&#1072; &#1080; &#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084;.</span></p><p class="c2 c5"><span class="c0"></span></p><p class="c2"><span class="c0">&#1053;&#1072; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103;&#1096;&#1085;&#1080;&#1081; &#1076;&#1077;&#1085;&#1100; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1086;&#1077; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1081;. &#1057;&#1088;&#1077;&#1076;&#1080; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089; &#1091;&#1095;&#1080;&#1090;&#1077;&#1083;&#1077;&#1084;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1086;&#1085;&#1086; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;: &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090;&#1089;&#1103; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1089;&#1090;, &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1072;&#1081;&#1087;&#1083;&#1072;&#1081;&#1085; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1069;&#1090;&#1086; &#1087;&#1088;&#1077;&#1087;&#1103;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1087;&#1086;&#1074;&#1089;&#1077;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086;&#1084;&#1091; &#1087;&#1088;&#1086;&#1085;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1102; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1080;&#1085;&#1076;&#1091;&#1089;&#1090;&#1088;&#1080;&#1102; &#1080; &#1085;&#1072;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1102; &#1085;&#1086;&#1074;&#1086;&#1081; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1101;&#1088;&#1099;. &#1052;&#1099; &#1088;&#1072;&#1079;&#1074;&#1080;&#1074;&#1072;&#1077;&#1084; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1077;&#1086;&#1076;&#1086;&#1083;&#1077;&#1090;&#1100; &#1101;&#1090;&#1080; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1077;&#1079; &#1091;&#1095;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1086;&#1077; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1084;&#1077;&#1090;&#1072;-&#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080; &#1090;.&#1076;., &#1074;&#1087;&#1083;&#1086;&#1090;&#1100; &#1076;&#1086; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1083;&#1083;&#1077;&#1082;&#1090;&#1072;.</span></p><p class="c2 c5"><span class="c0"></span></p><p class="c2"><span class="c0">&#1053;&#1072;&#1096;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;:</span></p><ul class="c8 lst-kix_v5tni44gig6i-0 start"><li class="c2 c3"><span class="c0">&#1055;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1089;&#1090;&#1086;&#1074;, &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1093; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084; &#1079;&#1085;&#1072;&#1085;&#1080;&#1081; &#1080; &#1085;&#1072;&#1074;&#1099;&#1082;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1077;&#1076;&#1074;&#1086;&#1089;&#1093;&#1080;&#1097;&#1072;&#1102;&#1090; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1099;&#1085;&#1082;&#1072;</span></li><li class="c2 c3"><span class="c0">&#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1086;&#1074;, &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1097;&#1080;&#1093; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076;&#1086;&#1074;&#1099;&#1093; &#1085;&#1072;&#1091;&#1095;&#1085;&#1099;&#1093; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081;</span></li><li class="c2 c3"><span class="c0">&#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1092;&#1091;&#1085;&#1076;&#1072;&#1084;&#1077;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1090;&#1077;&#1086;&#1088;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; Computer Science</span></li></ul><p class="c2 c5"><span class="c0"></span></p><p class="c2"><span class="c0">&#1053;&#1072;&#1096;&#1080; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:</span></p><ul class="c8 lst-kix_tfb401rabk56-0 start"><li class="c2 c3"><span class="c0">&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1072;&#1084; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1082;&#1088;&#1080;&#1090;&#1077;&#1088;&#1080;&#1077;&#1074;</span></li><li class="c2 c3"><span class="c0">&#1055;&#1086;&#1080;&#1089;&#1082; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1099; &#1085;&#1077;&#1081;&#1088;&#1086;&#1085;&#1085;&#1099;&#1093; &#1089;&#1077;&#1090;&#1077;&#1081; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1082;&#1088;&#1080;&#1090;&#1077;&#1088;&#1080;&#1077;&#1074;</span></li><li class="c2 c3"><span class="c0">&#1052;&#1077;&#1090;&#1086;&#1076; &#1088;&#1077;&#1075;&#1091;&#1083;&#1103;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1089;&#1085;&#1086;&#1081; &#1086;&#1094;&#1077;&#1085;&#1082;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080;</span></li><li class="c2 c3"><span class="c0">&#1059;&#1089;&#1082;&#1086;&#1088;&#1077;&#1085;&#1080;&#1077; &#1084;&#1077;&#1090;&#1072;-&#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1072;&#1087;&#1088;&#1080;&#1086;&#1088;&#1085;&#1099;&#1093; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1082;&#1088;&#1080;&#1090;&#1077;&#1088;&#1080;&#1077;&#1074;</span></li></ul><p class="c2 c5"><span class="c0"></span></p><p class="c2"><span class="c0">&#1053;&#1072;&#1096;&#1080; &#1087;&#1077;&#1088;&#1089;&#1087;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;:</span></p><ul class="c8 lst-kix_vsdo7um3p5dy-0 start"><li class="c2 c3"><span>ITMO.Auto</span><span class="c6">2</span><span class="c0">ML - &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1073;&#1077;&#1079; &#1091;&#1095;&#1080;&#1090;&#1077;&#1083;&#1103;</span></li><li class="c2 c3"><span class="c0">Logic graphs - &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1077;&#1084;&#1072;&#1085;&#1090;&#1080;&#1082;&#1086;-&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1073;&#1072;&#1079; &#1079;&#1085;&#1072;&#1085;&#1080;&#1081;</span></li></ul><p class="c2 c5"><span class="c0"></span></p><p class="c2"><span class="c0">&#1042;&#1089;&#1090;&#1091;&#1087;&#1080;&#1074; &#1074; &#1085;&#1072;&#1096;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;, &#1090;&#1099; &#1087;&#1088;&#1080;&#1084;&#1077;&#1096;&#1100; &#1091;&#1095;&#1072;&#1089;&#1090;&#1080;&#1077; &#1074; &#1078;&#1080;&#1079;&#1085;&#1080; &#1085;&#1072;&#1091;&#1095;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1081; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1086;&#1074;&#1099;&#1093; &#1080;&#1079;&#1076;&#1072;&#1085;&#1080;&#1081; &#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077; &#1080;&#1085;&#1085;&#1086;&#1074;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1079;&#1072;&#1074;&#1090;&#1088;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1084;&#1080;&#1088;, &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1081;&#1089;&#1103;!</span></p><p class="c2 c5"><span class="c0"></span></p><p class="c2"><span>&#1056;&#1091;&#1082;&#1086;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;: &#1082;.&#1090;.&#1085;., &#1076;&#1086;&#1094;. &#1092;&#1072;&#1082;&#1091;&#1083;&#1100;&#1090;&#1077;&#1090;&#1072; &#1055;&#1048;&#1080;&#1050;&#1058; </span><span class="c4"><a class="c10" href="https://www.google.com/url?q=https://edu.itmo.ru/teacher/224068/&amp;sa=D&amp;ust=1598882875810000&amp;usg=AOvVaw3afkJeTfFwGzzr9PhQbLNn">&#1048;&#1083;&#1100;&#1076;&#1072;&#1088; &#1041;&#1072;&#1081;&#1084;&#1091;&#1088;&#1072;&#1090;&#1086;&#1074;</a></span><span>, baimuratov.i@gmail.com</span></p>
  </body>
</html>
